AcRxClass.isDerivedFrom(AcRxClass!System.Runtime.CompilerServices.IsConst*,AcRxClass!System.Runtime.CompilerServices.IsConst*)
Static method for checking if first (left) class arg is derived from second (right) one
pDerived:  Ptr to class to test for derivation from pBase
pBase:  Ptr to class to test for being in pDerived's parenthood chain
Returns:  True if both class pointers are non-null and pDerived is derived from
(i.e. in the sub-tree of children of) pBase.  Otherwise false.
Remarks:  Both classes should be already registered with the class system.
All RxClasses are in the derived from AcRxObject::desc()

AcRxClass.queryX(AcRxClass!System.Runtime.CompilerServices.IsConst*)
This method searches for a protocol extension object associated with this object.
protocolClass:
Input pointer to AcRxClass object of the protocol extension class being searched for